#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру параметров подключения к web-сервису СППР.
//
// Возвращаемое значение:
//	Структура - ключи ИмяПользователя, ПарольПользователя.
//
Функция ПолучитьПараметры() Экспорт
	
	Результат = Новый Структура("ИмяПользователя, ПарольПользователя", "", "");
	Параметры = Константы.ПараметрыПодключенияСППР.Получить().Получить();
	
	Если ЗначениеЗаполнено(Параметры) Тогда
		ЗаполнитьЗначенияСвойств(Результат, Параметры);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Преобразует параметры подключения к web-сервису СППР в хранилище значения.
//
// Параметры:
//	ИмяПользователя - Строка - имя пользователя для подключения,
//	ПарольПользователя - Строка - пароль пользователя для подключения.
//
// Возвращаемое значение:
//	ХранилищеЗначения - содержит структуру с ключами ИмяПользователя, ПарольПользователя.
//
Функция ПолучитьХранилищеПараметров(ИмяПользователя, ПарольПользователя) Экспорт
	
	Результат = Новый Структура("ИмяПользователя, ПарольПользователя", ИмяПользователя, ПарольПользователя);
	Возврат Новый ХранилищеЗначения(Результат);
	
КонецФункции

#КонецОбласти

#КонецЕсли