#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Генерируем номер для создания уникальности набора записей.
	МаксимальныйНомер = ПолучитьМаксимальныйНомер();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Номер <> 0 Тогда
			Продолжить;
		КонецЕсли;
		МаксимальныйНомер = МаксимальныйНомер + 1;
		Запись.Номер = МаксимальныйНомер;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьМаксимальныйНомер()
	
	ЗапросПоНомеру = Новый Запрос;
	ЗапросПоНомеру.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОшибкиПроверкиКонфигурации.Номер КАК Номер
	|ИЗ
	|	РегистрСведений.ОшибкиПроверкиКонфигурации КАК ОшибкиПроверкиКонфигурации
	|УПОРЯДОЧИТЬ ПО
	|	ОшибкиПроверкиКонфигурации.Номер УБЫВ";
	
	ВыборкаПоНомеру = ЗапросПоНомеру.Выполнить().Выбрать();
	МаксимальныйНомер = ?(ВыборкаПоНомеру.Следующий(), ВыборкаПоНомеру.Номер, 0);
	
	Возврат МаксимальныйНомер;
	
КонецФункции

#КонецОбласти

#КонецЕсли