#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьКоличествоОсобенностейИзФоновогоЗадания(Конфигурация, АдресХранилища) Экспорт
	
	Количество = ПолучитьКоличествоОсобенностейКонфигурации(Конфигурация);
	ПоместитьВоВременноеХранилище(Количество, АдресХранилища);
	
КонецПроцедуры

Функция ПолучитьКоличествоОсобенностейКонфигурации(Конфигурация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(НайденныеОшибки.Номер) КАК КоличествоОсобенностей
	|ИЗ
	|	РегистрСведений.НайденныеОшибки КАК НайденныеОшибки
	|ГДЕ
	|	НайденныеОшибки.Объект.Владелец.Владелец = &Конфигурация
	|	И НайденныеОшибки.Состояние = &Состояние";
	
	Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостояниеОшибки.Особенность);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоОсобенностей;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#КонецЕсли