
#Область ПолучениеСведенийИзПроверяемойКонфигурации

// Процедура запускает проверяемую конфигурацию в режиме конфигуратора, чтобы выгрузить файлы XML
// самой конфигурации или расширения.
//
Процедура ЗапуститьВыгрузкуКонфигурацииВФайлыXML(Конфигурация, КаталогКонфигурации, Пользователь, Пароль,
	КаталогВыгрузки, ФайлЛога, ИмяРасширения = "", ДождатьсяЗавершения = Ложь) Экспорт
	
	#Если Клиент Тогда
	
	// Определяем строку запуска платформы.
	СтрокаЗапускаПлатформы = Конфигурация.СтрокаЗапускаПлатформы;
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	// Выгружаем конфигурацию в файлы xml.
	СтрокаЗапуска = """%1"" DESIGNER /F""%2"" /N""%3"" /P""%4"" /DumpConfigToFiles ""%5"""
		+ " %6 /Out ""%7"" /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		КаталогКонфигурации,
		Пользователь,
		Пароль,
		КаталогВыгрузки,
		?(ЗначениеЗаполнено(ИмяРасширения), "-Extension " + ИмяРасширения, ""),
		ФайлЛога);
	
	ЗапуститьПриложение(СтрокаЗапуска,, ДождатьсяЗавершения);
	Состояние("");
	
	#КонецЕсли
	
КонецПроцедуры

// Процедура запускает проверяемую конфигурацию в режиме конфигуратора, чтобы выгрузить файлы XML
// всех расширений.
//
Функция ВыгрузитьРасширенияВФайлыXML(Конфигурация, КаталогКонфигурации, Пользователь, Пароль, КаталогВыгрузки) Экспорт
	
	ФайлЛога = ПолучитьИмяВременногоФайла("txt");
		
	#Если Клиент Тогда
	
	// Определяем строку запуска платформы.
	СтрокаЗапускаПлатформы = Конфигурация.СтрокаЗапускаПлатформы;
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	// Выгружаем конфигурацию в файлы xml.
	СтрокаЗапуска = """%1"" DESIGNER /F""%2"" /N""%3"" /P""%4"" /DumpConfigToFiles ""%5"""
		+ " -AllExtensions /Out ""%6"""
		+ " /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		КаталогКонфигурации,
		Пользователь,
		Пароль,
		КаталогВыгрузки,
		ФайлЛога);
	
	КодВозврата = Неопределено;
	
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	Состояние("");
	
	ФайлУдалить(ФайлЛога);
	Возврат КодВозврата = 0;
	
	#КонецЕсли

КонецФункции

// Функция запускает проверяемую конфигурацию в режиме конфигуратора, чтобы выгрузить тексты модулей.
// Возвращает пустую строку, если выгрузка удачна, иначе лог выгрузки.
//
Функция ВыгрузитьМодули(Конфигурация, КаталогКонфигурации, Пользователь, Пароль, КаталогВыгрузки,
	ИмяРасширения = "") Экспорт
	
	ФайлЛога = ПолучитьИмяВременногоФайла("txt");
	
	#Если Клиент Тогда
	
	// Определяем строку запуска платформы.
	СтрокаЗапускаПлатформы = Конфигурация.СтрокаЗапускаПлатформы;
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	// Выгружаем модули.
	СтрокаЗапуска = """%1"" DESIGNER /F""%2"" /N""%3"" /P""%4"" /DumpConfigFiles ""%5"" -Module %6 /Out ""%7"""
		" /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		КаталогКонфигурации,
		Пользователь,
		Пароль,
		КаталогВыгрузки,
		?(ЗначениеЗаполнено(ИмяРасширения), "-Extension " + ИмяРасширения, ""),
		ФайлЛога);
	
	КодВозврата = Неопределено;
	
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	Состояние("");
	
	Если КодВозврата = 0 Тогда
		ФайлУдалить(ФайлЛога);
		Возврат "";
	КонецЕсли;
	
	#КонецЕсли
	
	Статус = ФайлПолучитьТекст(ФайлЛога);
	Возврат Статус;
	
КонецФункции

// Функция запускает проверяемую конфигурацию в режиме конфигуратора, чтобы выгрузить макеты.
// Возвращает пустую строку, если выгрузка удачна, иначе лог выгрузки.
//
Функция ВыгрузитьМакеты(Конфигурация, КаталогКонфигурации, Пользователь, Пароль, КаталогВыгрузки, ИмяРасширения = "") Экспорт
	
	ФайлЛога = ПолучитьИмяВременногоФайла("txt");
	
	#Если Клиент Тогда
		
	// Определяем строку запуска платформы.
	СтрокаЗапускаПлатформы = Конфигурация.СтрокаЗапускаПлатформы;
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	// Выгружаем модули.
	СтрокаЗапуска = """%1"" DESIGNER /F""%2"" /N""%3"" /P""%4"" /DumpConfigFiles ""%5"" -Templates"
		+ " %6 /Out ""%7"" /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		КаталогКонфигурации,
		Пользователь,
		Пароль,
		КаталогВыгрузки,
		?(ЗначениеЗаполнено(ИмяРасширения), "-Extension " + ИмяРасширения, ""),
		ФайлЛога);
	
	КодВозврата = Неопределено;
	
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	Состояние("");
	
	Если КодВозврата = 0 Тогда
		ФайлУдалить(ФайлЛога);
		Возврат "";
	КонецЕсли;
	
	#КонецЕсли
	
	Статус = ФайлПолучитьТекст(ФайлЛога);
	Возврат Статус;
	
КонецФункции

// Процедура запускает проверяемую конфигурацию в режиме конфигуратора,
// чтобы выполнить платформенную проверку конфигурации или расширений и выгрузить отчет в файл.
//
Процедура ЗапуститьПлатформеннуюПроверку(Конфигурация, КаталогКонфигурации, Пользователь, Пароль,
	ИмяФайлаРезультата, ИмяРасширения = "") Экспорт
	
	#Если Клиент Тогда
	
	РежимИспользованияМодальности = РаботаСВнешнимСоединением.ПолучитьРежимИспользованияМодальности(Конфигурация,
		КаталогКонфигурации, Пользователь, Пароль);
	
	// Определяем строку запуска платформы.
	СтрокаЗапускаПлатформы = Конфигурация.СтрокаЗапускаПлатформы;
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	ВерсияПлатформы = ПолучитьВерсиюПлатформыДляЗапуска(СтрокаЗапускаПлатформы);
	
	КлючиПлатформеннойПроверки = ""
		+ " -ConfigLogIntegrity"
		+ " -IncorrectReferences"
		+ " -ThinClient"
		+ " -WebClient"
		+ " -Server"
		+ " -ExternalConnection"
		+ " -ExternalConnectionServer"
		+ " -ThickClientManagedApplication"
		+ " -ThickClientServerManagedApplication"
		+ " -ThickClientOrdinaryApplication"
		+ " -ThickClientServerOrdinaryApplication"
		+ " -DistributiveModules"
		+ " -UnreferenceProcedures"
		+ " -HandlersExistence"
		+ " -EmptyHandlers"
		+ " -ExtendedModulesCheck"
		+ ?(РежимИспользованияМодальности, "", " -CheckUseModality")
		+ ?(РелизыПоПорядку("8.3.11.0", ВерсияПлатформы), " -CheckUseSynchronousCalls", "")
		+ ?(ЗначениеЗаполнено(ИмяРасширения), " -Extension " + ИмяРасширения, "");
	
	// Запускаем платформенную проверку.
	СтрокаЗапуска = """%1"" DESIGNER /F""%2"" /N""%3"" /P""%4"" /Out ""%5"" /CheckConfig %6"
		" /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		КаталогКонфигурации,
		Пользователь,
		Пароль,
		ИмяФайлаРезультата,
		КлючиПлатформеннойПроверки);
	
	ЗапуститьПриложение(СтрокаЗапуска);
	Состояние("");
	
	#КонецЕсли
	
КонецПроцедуры

// Функция запускает проверяемую конфигурацию в режиме конфигуратора,
// подключается к хранилищу, обновляется из него и обновляет информационную базу.
//
// Параметры:
//   ПараметрыЗапуска - Структура - структура параметров запуска:
//     Конфигурация           - СправочникСсылка.Конфигурации - ссылка на проверяемую конфигурацию;
//     СтрокаЗапускаПлатформы - Строка                        - путь к файлу платформы для запуска;
//     КаталогКонфигурации    - Строка                        - путь к каталогу информационной базы проверяемой конфигурации;
//     Пользователь           - Строка                        - логин пользователя информационной базы;
//     Пароль                 - Строка                        - пароль пользователя информационной базы;
//     КаталогХранилища       - Строка                        - путь к каталогу хранилища конфигурации;
//     ПользовательХранилища  - Строка                        - логин пользователя хранилища;
//     ПарольХранилища        - Строка                        - пароль пользователя хранилища;
//     ПерезапуститьНаНеобходимойПлатформе - Булево - флаг перезапуска команды, если платформа не соответствует необходимой;
//     ПерезаписатьСтрокуЗапускаПлатформыКонфигурации - Булево - флаг перезаписи пути к файлу запуска платформы.
//
// Возвращаемое значение:
//   Структура - результат загрузки и обновления конфигурации из хранилища. Ключи и значения:
//     Успешно         - Булево - Истина, если загрузка и обновления прошли успешно; иначе - Ложь.
//     ТекстОшибки     - Строка - текст ошибки, если загрузить или обновить конфигурацию не удалось.
//
Функция ЗагрузитьКонфигурациюИзХранилищаИОбновить(ПараметрыЗапуска) Экспорт
	
	ФайлЛога = ПолучитьИмяВременногоФайла("txt");
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	
	#Если Клиент Тогда
	
	// Определяем строку запуска платформы, сначала берем из параметров.
	СтрокаЗапускаПлатформы = ПараметрыЗапуска.СтрокаЗапускаПлатформы;
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		// Если в параметрах не заполнена, то берем из конфигурации.
		СтрокаЗапускаПлатформы = ПараметрыЗапуска.Конфигурация.СтрокаЗапускаПлатформы;
	КонецЕсли;
	
	// Если в конфигурации пустая, то берем текущую.
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	// Обновление из хранилища.
	СтрокаЗапуска = """%1"" DESIGNER /F""%2"" /N""%3"" /P""%4"" /ConfigurationRepositoryF ""%5"""
		" /ConfigurationRepositoryN ""%6"" /ConfigurationRepositoryP ""%7"""
		" /ConfigurationRepositoryUpdateCfg -revised -force /UpdateDBCfg /Out ""%8"""
		" /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		ПараметрыЗапуска.КаталогКонфигурации,
		ПараметрыЗапуска.Пользователь,
		ПараметрыЗапуска.Пароль,
		ПараметрыЗапуска.КаталогХранилища,
		ПараметрыЗапуска.ПользовательХранилища,
		ПараметрыЗапуска.ПарольХранилища,
		ФайлЛога);
	
	КодВозврата = Неопределено;
	
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	
	Если КодВозврата = 0 Тогда
		ФайлУдалить(ФайлЛога);
		Результат.Успешно = Истина;
		Возврат Результат;
	КонецЕсли;
	
	#КонецЕсли
	
	Результат.ТекстОшибки = ФайлПолучитьТекст(ФайлЛога);
	
	Если НЕ ПараметрыЗапуска.ПерезапуститьНаНеобходимойПлатформе Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыЗапуска.Вставить("ПерезапуститьНаНеобходимойПлатформе", Ложь);
	ПараметрыЗапуска.Вставить("ФункцияЗапуска", "ЗагрузитьКонфигурациюИзХранилищаИОбновить(ПараметрыЗапуска)");
	ПараметрыЗапуска.Вставить("ТекстЛога", Результат.ТекстОшибки);
	
	// Проверяем, что написано в логе, если платформа отличается от необходимой,
	// то проверяем наличие платформы на компьютере и пытаемся запустить ее.
	Результат = ПроверитьСтатусЗапускаПлатформыИПерезапустить(ПараметрыЗапуска);
	
	Возврат Результат;
	
КонецФункции

// Функция запускает проверяемую конфигурацию в режиме конфигуратора и принудительно отключает ее от хранилища.
//
Функция ОтключитьКонфигурациюОтХранилища(Конфигурация, КаталогКонфигурации, Пользователь = "", Пароль = "") Экспорт
	
	ФайлЛога = ПолучитьИмяВременногоФайла("txt");
	
	#Если Клиент Тогда
	
	// Определяем строку запуска платформы.
	СтрокаЗапускаПлатформы = Конфигурация.СтрокаЗапускаПлатформы;
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	// Обновление из хранилища.
	СтрокаЗапуска = """%1"" DESIGNER /F""%2"" /N""%3"" /P""%4"""
		" /ConfigurationRepositoryUnbindCfg -force /Out ""%5"""
		" /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		КаталогКонфигурации,
		Пользователь,
		Пароль,
		ФайлЛога);
	
	КодВозврата = Неопределено;
	
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	
	Если КодВозврата = 0 Тогда
		ФайлУдалить(ФайлЛога);
		Возврат "";
	КонецЕсли;
	
	#КонецЕсли
	
	Статус = ФайлПолучитьТекст(ФайлЛога);
	Возврат Статус;
	
КонецФункции

// Функция запускает проверяемую конфигурацию в режиме конфигуратора,
// подключается к хранилищу и формирует отчет по хранилищу во временный файл.
// В отчете производится поиск номера последней версии хранилища конфигурации.
//
// Параметры:
//   ПараметрыЗапуска - Структура - структура параметров запуска:
//     Конфигурация           - СправочникСсылка.Конфигурации - ссылка на проверяемую конфигурацию;
//     СтрокаЗапускаПлатформы - Строка                        - путь к файлу платформы для запуска;
//     КаталогКонфигурации    - Строка                        - путь к каталогу информационной базы проверяемой конфигурации;
//     Пользователь           - Строка                        - логин пользователя информационной базы;
//     Пароль                 - Строка                        - пароль пользователя информационной базы;
//     КаталогХранилища       - Строка                        - путь к каталогу хранилища конфигурации;
//     ПользовательХранилища  - Строка                        - логин пользователя хранилища;
//     ПарольХранилища        - Строка                        - пароль пользователя хранилища;
//     ПерезапуститьНаНеобходимойПлатформе - Булево - флаг перезапуска команды, если платформа не соответствует необходимой;
//     ПерезаписатьСтрокуЗапускаПлатформыКонфигурации - Булево - флаг перезаписи пути к файлу запуска платформы.
//
// Возвращаемое значение:
//   Структура - результат получения номера последней версии конфигурации хранилища. Ключи и значения:
//     Успешно         - Булево - Истина, если версия получена успешно; иначе - Ложь.
//     ВерсияХранилища - Строка - строковое значение номера версии хранилища.
//     ТекстОшибки     - Строка - текст ошибки, если версию получить не удалось.
//
Функция ПолучитьВерсиюХранилища(ПараметрыЗапуска) Экспорт
	
	ФайлЛога = ПолучитьИмяВременногоФайла("txt");
	ФайлОтчетаПоХранилищу = ПолучитьИмяВременногоФайла("mxl");
	ВерсияХранилища = "";
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ВерсияХранилища", "");
	
	#Если Клиент Тогда
	
	// Определяем строку запуска платформы, сначала берем из параметров.
	СтрокаЗапускаПлатформы = ПараметрыЗапуска.СтрокаЗапускаПлатформы;
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		// Если в параметрах не заполнена, то берем из конфигурации.
		СтрокаЗапускаПлатформы = ПараметрыЗапуска.Конфигурация.СтрокаЗапускаПлатформы;
	КонецЕсли;
	
	// Если в конфигурации пустая, то берем текущую.
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	// Обновление из хранилища.
	СтрокаЗапуска = """%1"" DESIGNER /F""%2"" /N""%3"" /P""%4"" /ConfigurationRepositoryF ""%5"""
		" /ConfigurationRepositoryN ""%6"" /ConfigurationRepositoryP ""%7"""
		" /ConfigurationRepositoryReport ""%8"" /Out ""%9"""
		" /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		ПараметрыЗапуска.КаталогКонфигурации,
		ПараметрыЗапуска.Пользователь,
		ПараметрыЗапуска.Пароль,
		ПараметрыЗапуска.КаталогХранилища,
		ПараметрыЗапуска.ПользовательХранилища,
		ПараметрыЗапуска.ПарольХранилища,
		ФайлОтчетаПоХранилищу,
		ФайлЛога);
	
	КодВозврата = Неопределено;
	
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	
	Если КодВозврата = 0 Тогда
		
		Результат = ПолучитьВерсиюХранилищаИзОтчета(ФайлОтчетаПоХранилищу);
		Если НЕ Результат.Успешно Тогда
			ТекстОшибки = НСтр("ru='Не удалось получить номер версии хранилища конфигурации по причине:%1%2'");
			Результат.ТекстОшибки = СтрШаблон(ТекстОшибки, Символы.ПС, Результат.ТекстОшибки);
		КонецЕсли;
		
		ФайлУдалить(ФайлЛога);
		ФайлУдалить(ФайлОтчетаПоХранилищу);
		
		Возврат Результат;
		
	КонецЕсли;
	
	#КонецЕсли
	
	Результат.ТекстОшибки = ФайлПолучитьТекст(ФайлЛога);
	ФайлУдалить(ФайлОтчетаПоХранилищу);
	
	Если НЕ ПараметрыЗапуска.ПерезапуститьНаНеобходимойПлатформе Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыЗапуска.Вставить("ПерезапуститьНаНеобходимойПлатформе", Ложь);
	ПараметрыЗапуска.Вставить("ФункцияЗапуска", "ПолучитьВерсиюХранилища(ПараметрыЗапуска)");
	ПараметрыЗапуска.Вставить("ТекстЛога", Результат.ТекстОшибки);
	
	// Проверяем, что написано в логе, если платформа отличается от необходимой,
	// то проверяем наличие платформы на компьютере и пытаемся запустить ее.
	Результат = ПроверитьСтатусЗапускаПлатформыИПерезапустить(ПараметрыЗапуска);
	
	Возврат Результат;
	
КонецФункции

// Функция считывает указанный файл отчета по хранилищу в табличный документ
// и возвращает номер последней версии конфигурации хранилища.
//
// Параметры:
//   ФайлОтчетаПоХранилищу - Строка - путь к файлу отчета по хранилищу.
//
// Возвращаемое значение:
//   Структура - результат получения номера последней версии конфигурации хранилища. Ключи и значения:
//     Успешно         - Булево - Истина, если версия получена успешно; иначе - Ложь.
//     ВерсияХранилища - Строка - строковое значение номера версии хранилища.
//     ТекстОшибки     - Строка - текст ошибки, если версию получить не удалось.
//
Функция ПолучитьВерсиюХранилищаИзОтчета(ФайлОтчетаПоХранилищу)
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ВерсияХранилища", "");
	
	Если НЕ ФайлСуществует(ФайлОтчетаПоХранилищу) Тогда
		Результат.ТекстОшибки = НСтр("ru='Файл отчета по истории хранилища не выгружен'");
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Прочитать(ФайлОтчетаПоХранилищу);
		
		Область = ТабличныйДокумент.НайтиТекст("Версия:",,,, Истина, Ложь);
		Если Область = Неопределено Тогда
			Результат.ТекстОшибки = НСтр("ru='В отчете по истории хранилища не найдена ячейка со значением ""Версия:""'");
			Возврат Результат;
		КонецЕсли;
		
		Верх = Область.Верх;
		Лево = Область.Лево;
		
		Область = ТабличныйДокумент.Область(Верх, Лево + 1, Верх, Лево + 1);
		ВерсияХранилища = Область.Текст;
		
		Если ПустаяСтрока(ВерсияХранилища) Тогда
			Результат.ТекстОшибки = НСтр("ru='В отчете по истории хранилища задана пустая последняя версия'");
			Возврат Результат;
		КонецЕсли;
		
		Результат.Успешно = Истина;
		Результат.ВерсияХранилища = ВерсияХранилища;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Результат.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Функция проверяет лог запуска платформы. Если находит определенное сообщение о запуске платформы,
// то перезапускает платформу на требуемой версии.
//
// Параметры:
//   ПараметрыЗапуска - Структура - структура параметров запуска:
//     Конфигурация           - СправочникСсылка.Конфигурации - ссылка на проверяемую конфигурацию;
//     СтрокаЗапускаПлатформы - Строка                        - путь к файлу платформы для запуска;
//     КаталогКонфигурации    - Строка                        - путь к каталогу информационной базы проверяемой конфигурации;
//     Пользователь           - Строка                        - логин пользователя информационной базы;
//     Пароль                 - Строка                        - пароль пользователя информационной базы;
//     КаталогХранилища       - Строка                        - путь к каталогу хранилища конфигурации;
//     ПользовательХранилища  - Строка                        - логин пользователя хранилища;
//     ПарольХранилища        - Строка                        - пароль пользователя хранилища;
//     ФункцияЗапуска         - Строка                        - строка вызова необходимой функции после переопределения платформы;
//     ТекстЛога              - Строка                        - текст лога запуска платформы с ошибкой;
//     ПерезапуститьНаНеобходимойПлатформе - Булево - флаг необходимости перезапуска команды,
//                                           если платформа не соответствует необходимой;
//     ПерезаписатьСтрокуЗапускаПлатформыКонфигурации - Булево - флаг перезаписи пути к файлу запуска платформы.
//
// Возвращаемое значение:
//   Структура - см. ЗагрузитьКонфигурациюИзХранилищаИОбновить и ПолучитьВерсиюХранилища.
//
Функция ПроверитьСтатусЗапускаПлатформыИПерезапустить(ПараметрыЗапуска)
	
	ТекстЛога = ПараметрыЗапуска.ТекстЛога;
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ТекстОшибки", ТекстЛога);
	
	Если ПустаяСтрока(ТекстЛога) Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивОшибок = Новый Массив;
	МассивОшибок.Добавить(НСтр("ru='Версия сервера хранилища конфигурации:'"));
	МассивОшибок.Добавить(НСтр("ru='Для работы с конфигурацией необходима версия платформы не меньше, чем'"));
	
	ПозицияПоиска = 0;
	Для Каждого ТекстОшибки Из МассивОшибок Цикл
		ПозицияПоиска = СтрНайти(ТекстЛога, ТекстОшибки);
		Если ПозицияПоиска > 0 Тогда
			// Если нашли текст ошибки, то прерываем.
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПозицияПоиска = 0 Тогда
		// Если не нашли сообщение, то возвращаем результат, который пришел на вход.
		Возврат Результат;
	КонецЕсли;
	
	ТекстСообщения = СокрЛ(Сред(ТекстЛога, ПозицияПоиска + СтрДлина(ТекстОшибки) + 1));
	ДлинаСообщения = СтрДлина(ТекстСообщения);
	
	ВерсияПлатформы = "";
	Для НомерСимвола = 1 По ДлинаСообщения Цикл
		Символ = Сред(ТекстСообщения, НомерСимвола, 1);
		Если ПустаяСтрока(Символ) ИЛИ (НЕ ЭтоЧисло(Символ)) И (Символ <> ".") Тогда
			Прервать;
		КонецЕсли;
		ВерсияПлатформы = ВерсияПлатформы + Символ;
	КонецЦикла;
	
	Если ПустаяСтрока(ВерсияПлатформы) Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивЭлементовВерсии = СтрРазделить(ВерсияПлатформы, ".", Ложь);
	Если МассивЭлементовВерсии.Количество() < 3 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВерсияПлатформы = СтрСоединить(МассивЭлементовВерсии, ".");
	Если МассивЭлементовВерсии.Количество() = 3 Тогда
		КаталогРелизаПлатформы = ПолучитьКаталогМаксимальногоРелизаПлатформы(ВерсияПлатформы);
	Иначе
		// Ищем указанный релиз платформы среди установленных на компьютере.
		ТаблицаРелизов = ПолучитьТаблицуУстановленныхРелизовПлатформы();
		СтрокаРелиза = ТаблицаРелизов.Найти(ВерсияПлатформы);
		Если СтрокаРелиза = Неопределено Тогда
			ТекстЛога = ТекстЛога + Символы.ПС + НСтр("ru='Требуемая версия платформы не установлена на компьютере.'");
			Результат.ТекстОшибки = ТекстЛога;
			Возврат Результат;
		КонецЕсли;
		
		КаталогРелизаПлатформы = СтрокаРелиза.Каталог;
	КонецЕсли;
	
	ФайлРелизаПлатформы = КаталогРелизаПлатформы + "\bin\1cv8.exe";
	Если НЕ ФайлСуществует(ФайлРелизаПлатформы) Тогда
		ТекстЛога = ТекстЛога + Символы.ПС + НСтр("ru='Требуемая версия платформы не установлена на компьютере.'");
		Результат.ТекстОшибки = ТекстЛога;
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыЗапуска.Вставить("СтрокаЗапускаПлатформы", ФайлРелизаПлатформы);
	
	Если ПараметрыЗапуска.ПерезаписатьСтрокуЗапускаПлатформыКонфигурации Тогда
		КонфигурацияСсылка = ПараметрыЗапуска.Конфигурация;
		КонфигурацияОбъект = КонфигурацияСсылка.ПолучитьОбъект();
		КонфигурацияОбъект.ВерсияПлатформы = ВерсияПлатформы;
		КонфигурацияОбъект.СтрокаЗапускаПлатформы = ФайлРелизаПлатформы;
		КонфигурацияОбъект.Записать();
	КонецЕсли;
	
	Результат = Вычислить(ПараметрыЗапуска.ФункцияЗапуска);
	
	Возврат Результат;
	
КонецФункции

// Процедура запускает проверяемую конфигурацию в режиме конфигуратора,
// чтобы выполнить проверку применения расширения к основной конфигурации и выгрузить отчет в файл.
//
Функция ВыполнитьПроверкуПримененияРасширения(Конфигурация, КаталогКонфигурации, Пользователь, Пароль,
	ИмяРасширения = "") Экспорт
	
	Статус = "";
	
	#Если Клиент Тогда
	
	ИмяФайлаРезультата = ПолучитьИмяВременногоФайла("txt");
	
	// Определяем строку запуска платформы.
	СтрокаЗапускаПлатформы = Конфигурация.СтрокаЗапускаПлатформы;
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	КлючПримененияРасширения = ?(ПустаяСтрока(ИмяРасширения), "-AllZones", "-Extension " + ИмяРасширения);
	
	// Запускаем платформенную проверку.
	СтрокаЗапуска = """%1"" DESIGNER /F""%2"" /N""%3"" /P""%4"" /Out ""%5"" /CheckCanApplyConfigurationExtensions %6"
		+ " /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		КаталогКонфигурации,
		Пользователь,
		Пароль,
		ИмяФайлаРезультата,
		КлючПримененияРасширения);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	
	Статус = ФайлПолучитьТекст(ИмяФайлаРезультата);
	
	#КонецЕсли
	
	Возврат Статус;
	
КонецФункции

#КонецОбласти