///////////////////////////////////////////////////////////////////////////////

Функция ПроверкаКонфигурацииgetRunTest(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ИдентификаторБазы = Запрос.ПараметрыURL.Получить("guid");
	
	МассивСтроки = СтрРазделить(ИдентификаторБазы, "-");
	Если (МассивСтроки.Количество() <> 5) ИЛИ 
		(МассивСтроки.Количество() = 5 И (СтрДлина(МассивСтроки[0]) <> 8 
		ИЛИ СтрДлина(МассивСтроки[1]) <> 4 
		ИЛИ СтрДлина(МассивСтроки[2]) <> 4 
		ИЛИ СтрДлина(МассивСтроки[3]) <> 4 
		ИЛИ СтрДлина(МассивСтроки[4]) <> 12)) Тогда
		
		Ответ.УстановитьТелоИзСтроки("invalid base identifier!");
	Иначе
		// запуск проверки
		УстановитьПривилегированныйРежим(истина);
		Результат = ИС_МеханизмыПроверкиКонфигураций.ЗапуститьПроверкуСВозвратомРезультата(ИдентификаторБазы);
		УстановитьПривилегированныйРежим(ложь);
		Ответ.УстановитьТелоИзСтроки(Результат);
	КонецЕсли;
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Возврат Ответ;
КонецФункции

///////////////////////////////////////////////////////////////////////////////

Функция БыстраяПроверкаquickTest(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	ТекстМодуля = Запрос.ПолучитьТелоКакСтроку();
	
	ПараметрыЗапроса_Почта 		= Запрос.ПараметрыЗапроса.Получить("email");
	ПараметрыЗапроса_ТипМодуля  = Запрос.ПараметрыЗапроса.Получить("type_mod");
	ПараметрыЗапроса_ТипОбъекта = Запрос.ПараметрыЗапроса.Получить("type_obj");
	
	Если ПараметрыЗапроса_Почта = Неопределено Тогда
		Ответ = Новый HTTPСервисОтвет(501);
		Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки("Не указан email");
		Возврат Ответ;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекстМодуля) Тогда
		Ответ = Новый HTTPСервисОтвет(501);
		Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки("Пустое тело запроса");
		Возврат Ответ;		
	КонецЕсли;

	УстановитьПривилегированныйРежим(истина);
	РезультатПроверки = ИС_ЕдиничнаяПроверка.ПроизвестиПроверку(ПараметрыЗапроса_ТипОбъекта, ПараметрыЗапроса_ТипМодуля, ТекстМодуля);
	ИС_ЕдиничнаяПроверка.ОтправитьСообщение(ПараметрыЗапроса_Почта, РезультатПроверки);
	УстановитьПривилегированныйРежим(ложь);
	
	Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(РезультатПроверки);
	
	Возврат Ответ;
КонецФункции

///////////////////////////////////////////////////////////////////////////////

Функция TestTest(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	ВходящаяСтрока = Запрос.ПараметрыURL.Получить("str");
	
	Если СтрНайти(нрег(ВходящаяСтрока), "how") 
			И СтрНайти(нрег(ВходящаяСтрока), "are")
			И СтрНайти(нрег(ВходящаяСтрока), "you") Тогда
			
		Ответ.УстановитьТелоИзСтроки("I'm fine!");	
	Иначе 
		Ответ.УстановитьТелоИзСтроки("invalid input string!");	
	КонецЕсли;
		
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Возврат Ответ;

КонецФункции


