#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область Обработчики

// Выполняет проверку конфигурации в соответствии с переданным списком требований.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Проверка.ОбработкаПроведенияДокументаПроверки(ЭтотОбъект);
	
КонецПроцедуры

// Обработчик перед записью документа. Синхронизирует информацию конфигурации по версии.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Версия.Владелец <> Конфигурация Тогда
		Конфигурация = Версия.Владелец;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли